ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_glb.c
const GLB_WAC_PLL_Cfg_Type ATTR_CLOCK_CONST_SECTION cpuPllCfg_380M[GLB_XTAL_MAX] = {
    { NULL, 0x0 },                              /*!< XTAL is None */
    { &cpuPllBasicCfg_24M_26M, 0xFD55 },        /*!< XTAL is 24M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x17C00 }, /*!< XTAL is 32M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x13CAA }, /*!< XTAL is 38.4M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x13000 }, /*!< XTAL is 40M */
    { &cpuPllBasicCfg_24M_26M, 0xE9D8 },        /*!< XTAL is 26M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x17C00 }, /*!< XTAL is RC32M */
};
const GLB_WAC_PLL_Cfg_Type ATTR_CLOCK_CONST_SECTION cpuPllCfg_400M[GLB_XTAL_MAX] = {
    { NULL, 0x0 },                              /*!< XTAL is None */
    { &cpuPllBasicCfg_24M_26M, 0x10AAA },       /*!< XTAL is 24M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x19000 }, /*!< XTAL is 32M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x14D55 }, /*!< XTAL is 38.4M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x14000 }, /*!< XTAL is 40M */
    { &cpuPllBasicCfg_24M_26M, 0xF627 },        /*!< XTAL is 26M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x19000 }, /*!< XTAL is RC32M */
};
const GLB_WAC_PLL_Cfg_Type ATTR_CLOCK_CONST_SECTION cpuPllCfg_480M[GLB_XTAL_MAX] = {
    { NULL, 0x0 },                              /*!< XTAL is None */
    { &cpuPllBasicCfg_24M_26M, 0x14000 },       /*!< XTAL is 24M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x1E000 }, /*!< XTAL is 32M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x19000 }, /*!< XTAL is 38.4M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x18000 }, /*!< XTAL is 40M */
    { &cpuPllBasicCfg_24M_26M, 0x12762 },       /*!< XTAL is 26M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x1E000 }, /*!< XTAL is RC32M */
};

const GLB_WAC_PLL_Cfg_Type ATTR_CLOCK_CONST_SECTION cpuPllCfg_520M[GLB_XTAL_MAX] = {
    { NULL, 0x0 },                              /*!< XTAL is None */
    { &cpuPllBasicCfg_24M_26M, 0x15AAA },       /*!< XTAL is 24M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x20800 }, /*!< XTAL is 32M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x1B155 }, /*!< XTAL is 38.4M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x1A000 }, /*!< XTAL is 40M */
    { &cpuPllBasicCfg_24M_26M, 0x14000 },       /*!< XTAL is 26M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x20800 }, /*!< XTAL is RC32M */
};
const GLB_WAC_PLL_Cfg_Type ATTR_CLOCK_CONST_SECTION cpuPllCfg_540M[GLB_XTAL_MAX] = {
    { NULL, 0x0 },                              /*!< XTAL is None */
    { &cpuPllBasicCfg_24M_26M, 0x16800 },       /*!< XTAL is 24M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x21C00 }, /*!< XTAL is 32M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x1C200 }, /*!< XTAL is 38.4M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x1B000 }, /*!< XTAL is 40M */
    { &cpuPllBasicCfg_24M_26M, 0x14C4E },       /*!< XTAL is 26M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x21C00 }, /*!< XTAL is RC32M */
};
const GLB_WAC_PLL_Cfg_Type ATTR_CLOCK_CONST_SECTION cpuPllCfg_560M[GLB_XTAL_MAX] = {
    { NULL, 0x0 },                              /*!< XTAL is None */
    { &cpuPllBasicCfg_24M_26M, 0x17555 },       /*!< XTAL is 24M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x23000 }, /*!< XTAL is 32M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x1D2AA }, /*!< XTAL is 38.4M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x1C000 }, /*!< XTAL is 40M */
    { &cpuPllBasicCfg_24M_26M, 0x1589D },       /*!< XTAL is 26M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x23000 }, /*!< XTAL is RC32M */
};
const GLB_WAC_PLL_Cfg_Type ATTR_CLOCK_CONST_SECTION cpuPllCfg_580M[GLB_XTAL_MAX] = {
    { NULL, 0x0 },                              /*!< XTAL is None */
    { &cpuPllBasicCfg_24M_26M, 0x182AA },       /*!< XTAL is 24M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x24400 }, /*!< XTAL is 32M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x1E355 }, /*!< XTAL is 38.4M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x1D000 }, /*!< XTAL is 40M */
    { &cpuPllBasicCfg_24M_26M, 0x164EC },       /*!< XTAL is 26M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x24400 }, /*!< XTAL is RC32M */
};
const GLB_WAC_PLL_Cfg_Type ATTR_CLOCK_CONST_SECTION cpuPllCfg_600M[GLB_XTAL_MAX] = {
    { NULL, 0x0 },                              /*!< XTAL is None */
    { &cpuPllBasicCfg_24M_26M, 0x19000 },       /*!< XTAL is 24M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x25800 }, /*!< XTAL is 32M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x1F400 }, /*!< XTAL is 38.4M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x1E000 }, /*!< XTAL is 40M */
    { &cpuPllBasicCfg_24M_26M, 0x1713B },       /*!< XTAL is 26M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x25800 }, /*!< XTAL is RC32M */
};

/* MIPI PLL Config*/
const GLB_MU_PLL_CFG_BASIC_Type ATTR_CLOCK_CONST_SECTION mipiPllBasicCfg_24M = {
    .clkpllRefdivRatio = 2,  /*!< pll_refdiv_ratio */
    .clkpllSelSampleClk = 2, /*!< pll_sel_sample_clk */
    .clkpllVcoSpeed = 5,     /*!< pll_vco_speed */
    .clkpllEvenDivEn = 0,    /*!< pll_even_div_en */
    .clkpllEvenDivRatio = 0, /*!< pll_even_div_ratio */
};
const GLB_MU_PLL_CFG_BASIC_Type ATTR_CLOCK_CONST_SECTION mipiPllBasicCfg_32M = {
    .clkpllRefdivRatio = 3,  /*!< pll_refdiv_ratio */
    .clkpllSelSampleClk = 2, /*!< pll_sel_sample_clk */
    .clkpllVcoSpeed = 5,     /*!< pll_vco_speed */
    .clkpllEvenDivEn = 0,    /*!< pll_even_div_en */
    .clkpllEvenDivRatio = 0, /*!< pll_even_div_ratio */
};
const GLB_MU_PLL_CFG_BASIC_Type ATTR_CLOCK_CONST_SECTION mipiPllBasicCfg_38P4M = {
    .clkpllRefdivRatio = 3,  /*!< pll_refdiv_ratio */
    .clkpllSelSampleClk = 2, /*!< pll_sel_sample_clk */
    .clkpllVcoSpeed = 5,     /*!< pll_vco_speed */
    .clkpllEvenDivEn = 0,    /*!< pll_even_div_en */
    .clkpllEvenDivRatio = 0, /*!< pll_even_div_ratio */
};
const GLB_MU_PLL_CFG_BASIC_Type ATTR_CLOCK_CONST_SECTION mipiPllBasicCfg_40M = {
    .clkpllRefdivRatio = 3,  /*!< pll_refdiv_ratio */
    .clkpllSelSampleClk = 2, /*!< pll_sel_sample_clk */
    .clkpllVcoSpeed = 5,     /*!< pll_vco_speed */
    .clkpllEvenDivEn = 0,    /*!< pll_even_div_en */
    .clkpllEvenDivRatio = 0, /*!< pll_even_div_ratio */
};
const GLB_MU_PLL_CFG_BASIC_Type ATTR_CLOCK_CONST_SECTION mipiPllBasicCfg_26M = {
    .clkpllRefdivRatio = 2,  /*!< pll_refdiv_ratio */
    .clkpllSelSampleClk = 2, /*!< pll_sel_sample_clk */
    .clkpllVcoSpeed = 5,     /*!< pll_vco_speed */
    .clkpllEvenDivEn = 0,    /*!< pll_even_div_en */
    .clkpllEvenDivRatio = 0, /*!< pll_even_div_ratio */
};
const GLB_MU_PLL_Cfg_Type ATTR_CLOCK_CONST_SECTION mipiPllCfg_1500M[GLB_XTAL_MAX] = {
    { NULL, 0x0 },                       /*!< XTAL is None */
    { &mipiPllBasicCfg_24M, 0x3E800 },   /*!< XTAL is 24M */
    { &mipiPllBasicCfg_32M, 0x46500 },   /*!< XTAL is 32M */
    { &mipiPllBasicCfg_38P4M, 0x3A980 }, /*!< XTAL is 38.4M */
    { &mipiPllBasicCfg_40M, 0x38400 },   /*!< XTAL is 40M */
    { &mipiPllBasicCfg_26M, 0x39B13 },   /*!< XTAL is 26M */
    { &mipiPllBasicCfg_32M, 0x46500 },   /*!< XTAL is RC32M */
};

/* uhs PLL 2100 Config*/
const GLB_MU_PLL_CFG_BASIC_Type ATTR_CLOCK_CONST_SECTION uhsPll2100BasicCfg_24M = {
    .clkpllRefdivRatio = 1,     /*!< pll_refdiv_ratio */
    .clkpllSelSampleClk = 2,    /*!< pll_sel_sample_clk */
    .clkpllVcoSpeed = 7,        /*!< pll_vco_speed */
    .clkpllEvenDivEn = 1,       /*!< pll_even_div_en */
    .clkpllEvenDivRatio = 2100/50, /*!< pll_even_div_ratio */
};
