ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_glb.c
    /* change root clock to rc32m */
    if ((dspXclkSel != GLB_DSP_XCLK_RC32M) || (dspRootClkSel != GLB_DSP_ROOT_CLK_XCLK)) {
        GLB_Set_DSP_XCLK_Sel(GLB_DSP_XCLK_RC32M);
        GLB_Set_DSP_ROOT_CLK_Sel(GLB_DSP_ROOT_CLK_XCLK);
    }

    /* set div */
    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CPU);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MM_GLB_REG_BCLK2X_DIV, dspBclkDiv);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MM_GLB_REG_CPU_CLK_DIV, dspClkDiv);
    BL_WR_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CPU, tmpVal);

    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CTRL_CPU);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MM_GLB_REG_BCLK2X_DIV_ACT_PULSE, 1);
    BL_WR_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CTRL_CPU, tmpVal);

    do {
        tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CTRL_CPU);
        tmpVal = BL_GET_REG_BITS_VAL(tmpVal, MM_GLB_STS_BCLK2X_PROT_DONE);
    } while ((--timeout) && (!tmpVal));
    if (!timeout) {
        return ERROR;
    }

    /* recover root clock */
    GLB_Set_DSP_XCLK_Sel(dspXclkSel);
    GLB_Set_DSP_ROOT_CLK_Sel(dspRootClkSel);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  get DSP0 DSP1 clock div
 *
 * @param  dspClkDiv: mm glb cpu div
 * @param  dspBclkDiv: mm glb bclk2x div
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION GLB_Get_DSP_System_CLK_Div(uint8_t *dspClkDiv, uint8_t *dspBclkDiv)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CPU);
    *dspBclkDiv = BL_GET_REG_BITS_VAL(tmpVal, MM_GLB_REG_BCLK2X_DIV);
    *dspClkDiv = BL_GET_REG_BITS_VAL(tmpVal, MM_GLB_REG_CPU_CLK_DIV);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Set dsp System clock
 *
 * @param  clkFreq: dsp system clock type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION GLB_Set_DSP_System_CLK(GLB_DSP_SYS_CLK_Type clkFreq)
{
    GLB_DSP_XCLK_Type dspXclkSel;

    CHECK_PARAM(IS_GLB_DSP_SYS_CLK_TYPE(clkFreq));

    /* get root clock */
    dspXclkSel = GLB_Get_DSP_XCLK_Sel();

    /* Before config XTAL and PLL ,make sure root clk is from RC32M */
    GLB_Set_DSP_XCLK_Sel(GLB_DSP_XCLK_RC32M);
    GLB_Set_DSP_ROOT_CLK_Sel(GLB_DSP_ROOT_CLK_XCLK);
    GLB_Set_DSP_System_CLK_Div(0, 0);

    /* select pll output clock before select root clock */
    if (GLB_DSP_SYS_CLK_MM_WIFIPLL_240M == clkFreq) {
        GLB_Set_DSP_MUXPLL_CLK_Sel(GLB_DSP_PLL_CLK_MUXPLL_240M);
    } else if (GLB_DSP_SYS_CLK_MM_WIFIPLL_320M == clkFreq) {
        GLB_Set_DSP_MUXPLL_CLK_Sel(GLB_DSP_PLL_CLK_MUXPLL_320M);
    } else if (GLB_DSP_SYS_CLK_CPUPLL_400M == clkFreq) {
        GLB_Set_DSP_MUXPLL_CLK_Sel(GLB_DSP_PLL_CLK_CPUPLL_400M);
    }

    /* select root clock */
    switch (clkFreq) {
        case GLB_DSP_SYS_CLK_RC32M:
            GLB_Set_DSP_System_CLK_Div(0, 0);
            GLB_Set_DSP_XCLK_Sel(GLB_DSP_XCLK_RC32M);
            GLB_Set_DSP_ROOT_CLK_Sel(GLB_DSP_ROOT_CLK_XCLK);
            break;
        case GLB_DSP_SYS_CLK_XTAL:
            GLB_Set_DSP_System_CLK_Div(0, 0);
            GLB_Set_DSP_XCLK_Sel(GLB_DSP_XCLK_XTAL);
            GLB_Set_DSP_ROOT_CLK_Sel(GLB_DSP_ROOT_CLK_XCLK);
            break;
        case GLB_DSP_SYS_CLK_MM_WIFIPLL_240M:
            GLB_Set_DSP_System_CLK_Div(0, 1);
            GLB_Set_DSP_Muxpll_240M_Sel(GLB_DSP_MUXPLL_SEL_WIFIPLL_240M);
            GLB_Set_DSP_ROOT_CLK_Sel(GLB_DSP_ROOT_CLK_PLL);
            /* recover xclk */
            GLB_Set_DSP_XCLK_Sel(dspXclkSel);
            break;
        case GLB_DSP_SYS_CLK_MM_WIFIPLL_320M:
            GLB_Set_DSP_System_CLK_Div(0, 1);
            GLB_Set_DSP_Muxpll_320M_Sel(GLB_DSP_MUXPLL_SEL_WIFIPLL_320M);
            GLB_Set_DSP_ROOT_CLK_Sel(GLB_DSP_ROOT_CLK_PLL);
            /* recover xclk */
            GLB_Set_DSP_XCLK_Sel(dspXclkSel);
            break;
        case GLB_DSP_SYS_CLK_CPUPLL_400M:
            GLB_Set_DSP_System_CLK_Div(0, 1);
            GLB_Set_DSP_ROOT_CLK_Sel(GLB_DSP_ROOT_CLK_PLL);
            /* recover xclk */
            GLB_Set_DSP_XCLK_Sel(dspXclkSel);
            break;
        default:
            break;
    }
    GLB_CLK_SET_DUMMY_WAIT;

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  select DSP0 pbus clock div
 *
 * @param  dspBclkDiv: mm glb bclk2x div
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION GLB_Set_DSP_PBCLK_Div(uint8_t dspPBclkDiv)
{
    uint32_t tmpVal = 0;

    /* set div */
    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CPU);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MM_GLB_REG_BCLK1X_DIV, dspPBclkDiv);
    BL_WR_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CPU, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  get DSP0 pbus clock div
 *
 * @param  dspBclkDiv: mm glb bclk2x div
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION GLB_Get_DSP_PBCLK_Div(uint8_t *dspPBclkDiv)
{
    *dspPBclkDiv = BL_GET_REG_BITS_VAL(BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CPU), MM_GLB_REG_BCLK1X_DIV);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Set dsp pbus clock
 *
 * @param  pbClkSel: dsp pbus clock type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION GLB_Set_DSP_PBCLK(GLB_DSP_SYS_PBCLK_Type pbClkSel)
{
    CHECK_PARAM(IS_GLB_DSP_SYS_PBCLK_TYPE(pbClkSel));

    GLB_Set_DSP_PBCLK_Div(0);

